{
  "_name_or_path": "CAMeL-Lab/bert-base-arabic-camelbert-mix",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.3,
  "hidden_size": 768,
  "id2label": {
    "0": "\u0627\u0644\u062a\u0633\u0648\u0642 \u0648\u0627\u0644\u0645\u0633\u062a\u0644\u0632\u0645\u0627\u062a",
    "1": "\u0627\u0644\u0633\u0643\u0646 \u0648\u0627\u0644\u0641\u0648\u0627\u062a\u064a\u0631",
    "2": "\u0645\u0635\u0627\u0631\u064a\u0641 \u0623\u062e\u0631\u0649 \u0648\u062a\u0628\u0631\u0639\u0627\u062a",
    "3": "\u0627\u0644\u0637\u0639\u0627\u0645 \u0648\u0627\u0644\u0634\u0631\u0627\u0628",
    "4": "\u0627\u0644\u062a\u0632\u0627\u0645\u0627\u062a \u0645\u0627\u0644\u064a\u0629",
    "5": "\u0627\u0644\u0645\u0648\u0627\u0635\u0644\u0627\u062a",
    "6": "\u0627\u0644\u062a\u0631\u0641\u064a\u0647",
    "7": "\u0627\u0644\u062f\u062e\u0644",
    "8": "\u062a\u062d\u0648\u064a\u0644\u0627\u062a",
    "9": "\u0627\u0644\u062a\u0639\u0644\u064a\u0645",
    "10": "\u0627\u0644\u0635\u062d\u0629",
    "11": "\u0627\u0644\u0642\u0627\u062a"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "\u0627\u0644\u062a\u0631\u0641\u064a\u0647": 6,
    "\u0627\u0644\u062a\u0632\u0627\u0645\u0627\u062a \u0645\u0627\u0644\u064a\u0629": 4,
    "\u0627\u0644\u062a\u0633\u0648\u0642 \u0648\u0627\u0644\u0645\u0633\u062a\u0644\u0632\u0645\u0627\u062a": 0,
    "\u0627\u0644\u062a\u0639\u0644\u064a\u0645": 9,
    "\u0627\u0644\u062f\u062e\u0644": 7,
    "\u0627\u0644\u0633\u0643\u0646 \u0648\u0627\u0644\u0641\u0648\u0627\u062a\u064a\u0631": 1,
    "\u0627\u0644\u0635\u062d\u0629": 10,
    "\u0627\u0644\u0637\u0639\u0627\u0645 \u0648\u0627\u0644\u0634\u0631\u0627\u0628": 3,
    "\u0627\u0644\u0642\u0627\u062a": 11,
    "\u0627\u0644\u0645\u0648\u0627\u0635\u0644\u0627\u062a": 5,
    "\u062a\u062d\u0648\u064a\u0644\u0627\u062a": 8,
    "\u0645\u0635\u0627\u0631\u064a\u0641 \u0623\u062e\u0631\u0649 \u0648\u062a\u0628\u0631\u0639\u0627\u062a": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.48.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30000
}
